[
    {   
        "id" : 1,
        "categorie": "AI",
        "thumbnail": "https://i.imgur.com/QaNBQBrl.png",
        "desktopImage" : "https://i.imgur.com/QaNBQBr.png",
        "mobileImage": "https://i.imgur.com/rGeo0Ge.png",
        "title": "Green Guru",
        "description": "An environmental awareness bot which can offer insights and guidance on sustainability and green living.",
        "skills": ["ReactJS", "OpenAI Assistants API", "ExpressJS", "NodeJS"],
        "live": "https://chat-bot-red-phi.vercel.app/",
        "repo": "https://github.com/Alex-dev7/_ChatBot_",
        "class": "first-card"
    },
    {
        "id" : 2,
        "categorie": "Frontend CMS",
        "thumbnail": "https://i.imgur.com/upuh6Tdl.png",
        "desktopImage" : "https://i.imgur.com/upuh6Td.png",
        "mobileImage": "https://imgur.com/OOnBOgM.png",
        "title": "Lake House Bistro",
        "description": " Client Work: Lake House Bistro is a restaurant website I developed using a cutting-edge tech stack. Built with NextJS, TypeScript, Tailwind, Sanity.io, GROQ, and a robust CMS, the website delivers a seamless user experience. NextJS ensures fast performance and optimized search engine visibility, while TypeScript guarantees reliability and maintainability. The visually stunning design is crafted using Tailwind. The CMS powered by Sanity.io and GROQ allows effortless content management, ensuring up-to-date menus and events. Lake House Bistro offers a diverse menu inspired by local and global cuisine, and the website provides easy access to online reservations, event updates, and social media connections. This project showcases my expertise in creating high-quality web applications that meet clients unique needs.",
        "skills": ["NextJS",  "TypeScript", "Tailwind",  "Sanity.io", "GROQ", "CMS"],
        "live": "https://lakehousebistro.com/",
        "class": "sixth-card"
    },
    {
        "id" : 3,
        "categorie": "Full Stack",
        "thumbnail": "https://i.imgur.com/Oq5RKexl.png",
        "desktopImage" : "https://i.imgur.com/Oq5RKex.png",
        "mobileImage": "https://i.imgur.com/tRLcI1O.png",
        "title": "SyntaxSoup",
        "description": "SyntaxSoup is a blog that chalanges you to be a better programmer, stay humble, and to keep on learning. This blogging app is built with Next.js, Prisma, and PostgreSQL. The app allows users to create an account and publish blog posts. Users can view a list of all published posts, view individual posts, search for posts based on their title or tag, delete, and upgrade posts that he created. This application is written in TypeScript, ensuring strong type safety throughout the codebase. Overall, the app is designed to provide a modern and user-friendly interface for creating and sharing content online.",
        "skills": ["NextJS", "Prisma", "TypeScript", "Tailwind", "NextAuth", "PostgreSQL", "Responsive Design"],
        "live": "https://sytycc-blog.vercel.app",
        "repo": "https://github.com/Alex-dev7/GA-CAPSTONE-PROJECT",
        "class": "fifth-card"
    },
    {
        "id" : 4,
        "categorie": "Full Stack",
        "thumbnail": "https://i.imgur.com/6aGXhWOl.png",
        "desktopImage" : "https://i.imgur.com/6aGXhWO.png",
        "mobileImage": "https://imgur.com/VJQ8JvS.png",
        "title": "SupplySmart",
        "description": "SupplySmart is a dynamic and user-friendly tool for managing an inventory of tools and supplies. With a full CRUD functionality, the app will allow users to input and store data on each item in the inventory, such as its name, description, quantity, image and location. Using React's component-based architecture, the app has a modular design that makes it easy to add new features or modify existing ones. Intuitive and easy to use, with a clear and concise user interface that allows users to quickly and efficiently navigate and manage the inventory. The app also has a responsive design, allowing it to work seamlessly on any device, including desktops, laptops, tablets, and smartphones. With this app, users will be able to easily track the availability and location of tools and supplies, making it an essential tool for any workshop, garage, or storage facility.",
        "skills": ["ReactJS", "react-router-dom", "SCSS", "Django", "PostgreSQL", "CORS", "Responsive Design"],
        "live": "https://supplysmart-ar.netlify.app/",
        "repo": "https://github.com/Alex-dev7/Project4-inventoryApp-frontend",
        "class": "fourth-card"
    },
    {
        "id" : 5,
        "categorie": "Full Stack",
        "thumbnail": "https://i.imgur.com/MmBBmOul.png",
        "desktopImage" : "https://i.imgur.com/MmBBmOu.png",
        "mobileImage": "https://imgur.com/ANRDv7t.png",
        "title": "MyEvents",
        "description": "MyEvents is a React application that allows users to view, create, delete, and update events. The app features user authentication, ensuring that only authorized users can access and manipulate event information. The user interface is intuitive and easy to navigate, allowing users to quickly and efficiently manage their events. Additionally, the application integrates with a backend service to securely store and retrieve event data. Overall, “MyEvents” is a powerful and user-friendly tool for managing events and keeping track of important dates and deadlines.",
        "skills": ["ReactJS", "react-router-dom", "SCSS", "Bootstrap", "ExpressJS", "PostgreSQL", "JWT", "Bcrypt", "Responsive Design"],
        "live": "https://myevents-s.netlify.app/",
        "repo-backend": "https://github.com/cindywongdev/Project3-myEvents-backend",
        "repo": "https://github.com/Alex-dev7/Project3-myEvents-frontend",
        "class": "third-card"
    },
    {   
        "id" : 6,
        "categorie": "Full Stack",
        "thumbnail": "https://i.imgur.com/UWxjF08l.png",
        "desktopImage" : "https://i.imgur.com/UWxjF08.png",
        "mobileImage": "https://imgur.com/sygPqBE.png",
        "title": "Missing Pets",
        "description": "Missing Pets is a server side rendered application that uses EJS templates to display the website. In the app you can create a missing/found pet flyer, and post it on the bulletin board. Every user can see the post, and comment on it. To create a flyer, the user will make an account, that will give them acces to a template form, which after submition will be displayed on the bulletin board.",
        "skills": ["CSS", "JavaScript", "EJS", "ExpressJS", "express-session","Bcrypt", "NodeJS", "MongoDB", "Mongoose", "MVC Architecture", "Responsive Design"],
        "live": "https://missing-pets.onrender.com/",
        "repo": "https://github.com/Alex-dev7/Missing_Pet_Project2",
        "class": "second-card"
    },
    {   
        "id" : 7,
        "categorie": "Frontend",
        "thumbnail": "https://i.imgur.com/FHqD6ETl.png",
        "desktopImage" : "https://i.imgur.com/FHqD6ET.png",
        "mobileImage": "https://imgur.com/51JGqvY.png",
        "title": "Pocket Sommelier",
        "description": "Pocket Sommelier is a frontend application that is making AJAX calls to a third party API. This tool will help you find a good food match for your wine or vice versa. The app presents you with two search options, one that will look for a food pairing for the specific wine, and other will look for a wine pairing for the choice of food. The search result will display on the page with the serving recommendations, wine descriptions and images.",
        "skills": ["HTML", "CSS", "JavaScript", "JQuery", "Spoonacular API", "Responsive Design"],
        "live": "https://pocket-sommelier.vercel.app/",
        "repo": "https://github.com/Alex-dev7/Project1-SEI",
        "class": "first-card"
    },
    {   
        "id" : 8,
        "categorie": "Mobile App",
        "thumbnail": "https://i.imgur.com/dHXrhOkl.png",
        "desktopImage" : "https://i.imgur.com/ModsueL.png",
        "mobileImage": "https://i.imgur.com/ModsueL.png",
        "title": "Guess My Number",
        "description": "Welcome to the Guess My Number game built using React Native! This simple and entertaining game challenges you to think of a number between 1 and 99, and then it's the phone's task to guess that number. As the player, you provide hints to the phone, and the game continues until the phone successfully guesses your chosen number.",
        "skills": ["React Native", "Expo"],
        "repo": "https://github.com/Alex-dev7/number_guessing_game_RN",
        "class": "first-card", 
        "videoPath": "youtube"
    }

]